MicrochipTech/dspic33a-high-speed-adc-example/capture.c
/* Switch the stream off hard, so that a 40 MSPS stream does not keep
 * hammering the bus while fail() or a trap handler prints. */
void capture_halt(void)
{
    dma0_halt();
}

/* ------------------------------------------------------------------ *
 * DMA event - one per buffer half, called from the DMA0 interrupt
 *
 * HALF: the first half is complete, the DMA is filling the second.
 * DONE: the second half is complete, the DMA has reloaded to the start
 *       and the ADC burst has ended - apply a pending input change and,
 *       if the stream is enabled, start the next burst here.
 *
 * Runs in the interrupt, priority 4 (IPC9 default). The console's UART
 * receive interrupt runs at priority 1, so this preempts a running
 * command.
 *
 * Deliberately short. Everything this counts is a hardware flag, so a
 * long handler would itself become the reason for the next overrun.
 * ------------------------------------------------------------------ */
void dma0_event(uint32_t st)
{
    if (st & DMA0_OVERRUN) {
        /* Triggered while the previous transfer was still in progress
         * (p816): the bus did not keep up. This is the measurement. */
        dma_overrun++;
        dma0_clear(DMA0_OVERRUN);
    }
    if (st & DMA0_ADRERR) {
        dma_addr_err++;
        dma0_clear(DMA0_ADRERR);
    }
    if (st & (DMA0_BRERR | DMA0_BWERR)) {
        dma_bus_err++;
        dma0_clear(DMA0_BRERR | DMA0_BWERR);
    }

    /* Both halves pending at once means this handler arrived more than
     * one half (25.6 us) late and the first half has already been
     * overwritten by the DMA reload. */
    if ((st & DMA0_HALF) && (st & DMA0_DONE)) {
        late_service++;
    }

    if (st & DMA0_HALF) {
        dma0_clear(DMA0_HALF);
        ready_half  = 0u;
        last_sample = buf[SAMPLES_PER_HALF - 1u];
        blocks_done++;
    }
    if (st & DMA0_DONE) {
        dma0_clear(DMA0_DONE);
        ready_half  = 1u;
        last_sample = buf[SAMPLES_PER_BUF - 1u];
        blocks_done++;

        /* The channel is idle between bursts: this is the only safe
         * moment to change its input or sample time. */
        if (switch_pending) {
            adc_set_input(pinsel_next, samc_next);
            switch_pending = false;
        }
        if (pacing_pending) {
            /* Never involves the clock-divider or single-conversion
             * source: those go through quiesce() in capture_set_pacing(). */
            adc_set_trg2((pacing_next == ADC_PACE_CLKDIV) ? ADC_TRG2_B2B : pacing_next);
            pacing_cur     = pacing_next;
            pacing_pending = false;
        }
        if (period_pending) {
            apply_period(period_next);
            period_pending = false;
        }
        if (pacing_cur == ADC_PACE_SINGLE) {
            /* Nothing to restart: the trigger keeps running and the DMA
             * has reloaded its block. capture_stop() ends it. */
        } else if (run_enabled) {
            start_burst();            /* next SAMPLES_PER_BUF samples   */
        } else {
            burst_active = false;
        }
    }
}

/* ------------------------------------------------------------------ *
 * Control API (capture.h)
 * ------------------------------------------------------------------ */
void capture_start(void)
{
    if (!powered) {
        /* After capture_shutdown(): clock first, then the core - the boot
         * order. Registers kept their values, so pacing and period are
         * what they were. A wait that runs out is reported and the
         * start refused; the counters show nothing moving. */
        const bool clk = clock_adc_on();
        const bool adc = adc_reinit();
        if (!clk || !adc) {
            console_puts(clk ? "[capture] ADC core did not come back (ADRDY)\r\n"
                             : "[capture] CLKGEN6 did not come back (CLKRDY)\r\n");
            return;
        }
        powered = true;
    }
    run_enabled = true;
    if (!burst_active) {
        start_burst();
    }
}

void capture_shutdown(void)
{
    (void)quiesce();                  /* stream off, burst finished     */
    adc_deinit();
    clock_adc_off();
    powered = false;
}

bool capture_powered(void)
{
    return powered;
}

bool capture_select_core(uint8_t core, uint8_t pinsel, uint8_t samc)
{
    if ((core < 1u) || (core > 5u)) { return false; }
    (void)quiesce();
    sccp1_stop();
    if (powered) { adc_deinit(); }
    else         { (void)clock_adc_on(); }   /* the new core needs its clock */
    if (clock_adc_div() != 100u) { (void)clock_adc_set_div(100u); }
    (void)adc_select(core);
    adc_init(pinsel, samc, ADC_RPTCNT);      /* core on, ADRDY, or fail(5) */
    capture_init();                          /* DMA on this core's trigger */
    pacing_cur     = ADC_TRG2_REPEAT;
    pacing_pending = false;
    period_pending = false;
    switch_pending = false;
    pinsel_next    = pinsel;
    samc_next      = samc;
    sccp_ticks     = ADC_SCCP_TICKS;
    powered        = true;
    burst_active   = false;
    counters_clear();
    return true;
}

void capture_stop(void)
{
    run_enabled = false;
    if (pacing_cur == ADC_PACE_SINGLE) {
        sccp1_stop();                 /* no trigger, no conversion      */
        burst_active = false;
    }
}

bool capture_running(void)
{
    return run_enabled;
}

bool capture_burst_active(void)
{
    return burst_active;
}

bool capture_set_input(uint8_t pinsel, uint8_t samc)
{
    if ((pinsel > 15u) || (samc > 31u)) {
        return false;
    }
    pinsel_next = pinsel;
    samc_next   = samc;
    switch_pending = true;
    if (!burst_active) {
        /* Nothing running: apply right away, the channel is idle. */
        adc_set_input(pinsel, samc);
        switch_pending = false;
    }
    return true;
}

uint8_t capture_pinsel(void) { return adc_pinsel(); }
uint8_t capture_samc(void)   { return adc_samc(); }

/* ------------------------------------------------------------------ *
 * Pacing (capture.h): which trigger sets the rate, and its period
 * ------------------------------------------------------------------ */
static const uint32_t sweep_repeat[] = { 63u, 32u, 16u, 8u, 4u, 3u, 2u };  /* 1.27..40 MSPS */
static const uint32_t sweep_sccp[]   = { 80u, 40u, 20u, 10u, 8u, 5u, 4u }; /* 1.25..25 MSPS */
static const uint32_t sweep_b2b[]    = { 0u };                             /* one row       */
/* ADC clock divider, ratio in hundredths. First pass the even ratios,
 * INTDIV alone: 10, 8, 6, 4, 2, 1 = 4, 5, 6.7, 10, 20, 40 MSPS (32 MHz is
 * the ADC clock minimum, so 10 is the largest). Second pass with the
 * fractional part: 9, 7, 5, 3, 2.5, 1.6, 1.25 = 4.4, 5.7, 8, 13.3, 16,
 * 25, 32 MSPS - 8 MSPS is the customer's floor, 25 and 32 are the rates
 * the even ratios cannot reach; below 200 INTDIV is 0 and the fraction
 * alone has to divide, which the measured column will confirm or not. */
static const uint32_t sweep_clkdiv[]  = { 1000u, 800u, 600u, 400u, 200u, 100u };
static const uint32_t sweep_clkdiv2[] = { 900u, 700u, 500u, 300u, 250u, 160u, 125u };

bool capture_set_pacing(uint8_t pacing)
{
    uint32_t period;
    switch (pacing) {
    case ADC_TRG2_REPEAT:  period = ADC_RPTCNT;     break;
    case ADC_TRG2_SCCP1:   period = ADC_SCCP_TICKS; break;
    case ADC_PACE_CLKDIV:  period = ADC_CLKDIV;     break;
    case ADC_PACE_SINGLE:  period = ADC_SCCP_TICKS; break;
    case ADC_TRG2_B2B:     period = 0u;             break;
    default:               return false;
    }
    /* Into or out of the clock-divider source the ADC is switched off
     * and on, into or out of the single-conversion source its operating
     * mode changes: not between two bursts in the ISR, but now, with the
     * stream stopped and restarted around it. */
    bool restart = false;
    if ((pacing == ADC_PACE_CLKDIV) || (pacing_cur == ADC_PACE_CLKDIV) ||
        (pacing == ADC_PACE_SINGLE) || (pacing_cur == ADC_PACE_SINGLE)) {
        restart = quiesce();
    }
    if (pacing != ADC_TRG2_SCCP1) { sccp1_stop(); }
    if ((pacing_cur == ADC_PACE_SINGLE) && (pacing != ADC_PACE_SINGLE) && !burst_active) {
        adc_set_mode_burst();
    }
    /* Leaving the clock-divider source: back to the full ADC clock, so
     * that the other sources' units (TAD, 10 ns ticks) mean what the
     * comments say. */
    if ((pacing_cur == ADC_PACE_CLKDIV) && (pacing != ADC_PACE_CLKDIV)) {
        (void)adc_clock_switch(1u);
    }
    pacing_next    = pacing;
    pacing_pending = true;
    period_next    = period;
    period_pending = true;
    if (!burst_active) {
        if (pacing == ADC_PACE_SINGLE) {
            adc_set_mode_single(ADC_TRG2_SCCP1);   /* same code in Table 16-3 */
            adc_set_trg2(ADC_TRG2_B2B);            /* unused in this mode     */
        } else {
            adc_set_trg2((pacing == ADC_PACE_CLKDIV) ? ADC_TRG2_B2B : pacing);
        }
        pacing_cur = pacing;
        apply_period(period);
        pacing_pending = period_pending = false;
    }
    if (restart) { capture_start(); }
    return true;
}

uint8_t capture_pacing(void) { return pacing_cur; }

const char *capture_pacing_name(void)
{
    switch (pacing_cur) {
    case ADC_TRG2_REPEAT:  return "ADC repeat timer (period in TAD = 12.5 ns)";
    case ADC_TRG2_SCCP1:   return "SCCP1 timer (period in ticks of 10 ns)";
    case ADC_PACE_CLKDIV:  return "ADC clock divider (period = divide ratio of 320 MHz, back-to-back)";
    case ADC_PACE_SINGLE:  return "one conversion per SCCP1 trigger, no burst (period in ticks of 10 ns)";
    case ADC_TRG2_B2B:     return "back-to-back (no rate control)";
    default:               return "unknown pacing";
    }
}

bool capture_set_period(uint32_t period)
{
    switch (pacing_cur) {
    case ADC_TRG2_REPEAT:  if ((period < 2u) || (period > 63u))    { return false; } break;
    case ADC_TRG2_SCCP1:   if ((period < 2u) || (period > 65535u)) { return false; } break;
    case ADC_PACE_SINGLE:  if ((period < 2u) || (period > 65535u)) { return false; } break;
    case ADC_PACE_CLKDIV:  if ((period < 100u) || (period > 1000u)) { return false; } break;
    default:               return false;
    }
    if (pacing_cur == ADC_PACE_CLKDIV) {
        /* ADC off and on around the clock switch: stop the stream, do
         * it now, restart. Not deferred to the DONE moment. */
        const bool restart = quiesce();
        const bool ok      = adc_clock_switch(period);
        period_pending     = false;
        if (restart) { capture_start(); }
        return ok;
    }
    period_next    = period;
    period_pending = true;
    if (!burst_active) {
        apply_period(period);
        period_pending = false;
    }
    return true;
}

