MicrochipTech/dspic33a-high-speed-adc-example/capture.c
uint32_t capture_period(void)
{
    switch (pacing_cur) {
    case ADC_TRG2_REPEAT:  return adc_period();
    case ADC_TRG2_SCCP1:   return sccp_ticks;
    case ADC_PACE_SINGLE:  return sccp_ticks;
    case ADC_PACE_CLKDIV:  return clock_adc_div();
    default:               return 0u;
    }
}

uint32_t capture_nominal_ksps(uint32_t period)
{
    if (period == 0u) { return 0u; }
    switch (pacing_cur) {
    case ADC_TRG2_REPEAT:  return 80000u / period;              /* 320 MHz / 4 / n */
    case ADC_TRG2_SCCP1:   return SCCP_TICK_HZ / 1000u / period; /* 100 MHz / n     */
    case ADC_PACE_SINGLE:  return SCCP_TICK_HZ / 1000u / period; /* 100 MHz / n     */
    case ADC_PACE_CLKDIV:  return 4000000u / period;            /* 40 MSPS / (ratio/100) */
    default:               return 0u;
    }
}

const uint32_t *capture_sweep_periods(uint32_t *count)
{
    switch (pacing_cur) {
    case ADC_TRG2_REPEAT:  *count = sizeof sweep_repeat / sizeof sweep_repeat[0]; return sweep_repeat;
    case ADC_TRG2_SCCP1:   *count = sizeof sweep_sccp / sizeof sweep_sccp[0];     return sweep_sccp;
    case ADC_PACE_SINGLE:  *count = sizeof sweep_sccp / sizeof sweep_sccp[0];     return sweep_sccp;
    case ADC_PACE_CLKDIV:  *count = sizeof sweep_clkdiv / sizeof sweep_clkdiv[0]; return sweep_clkdiv;
    default:               *count = 1u;                                          return sweep_b2b;
    }
}

const uint32_t *capture_sweep_periods2(uint32_t *count)
{
    if (pacing_cur == ADC_PACE_CLKDIV) {
        *count = sizeof sweep_clkdiv2 / sizeof sweep_clkdiv2[0];
        return sweep_clkdiv2;
    }
    *count = 0u;
    return NULL;
}

const volatile uint16_t *capture_completed_half(void)
{
    return &buf[ready_half ? SAMPLES_PER_HALF : 0u];
}

void counters_clear(void)
{
    dma_overrun = 0; dma_addr_err = 0; dma_bus_err = 0;
    late_service = 0; proc_missed = 0;
    /* Halves completed up to now are not "missed" from here on. Without
     * this the first capture_service() after the self-test books its
     * 12 unserviced halves as proc_missed, and the heartbeat goes to the
     * error rate before the measurement has even started. */
    seen_blocks = blocks_done;
}

/* ------------------------------------------------------------------ *
 * Process one completed buffer half
 *
 * Placeholder for the customer's "+ and -" arithmetic. Written as a
 * plain accumulate so the cost of touching every sample is visible in
 * the measurement: at 40 MSPS this loop sees 40 million values per
 * second and per channel, and whether the CPU keeps up is as much a
 * question as the DMA bandwidth.
 * ------------------------------------------------------------------ */
static void process_buffer(const volatile uint16_t *b, uint32_t n)
{
    int32_t acc = 0;
    for (uint32_t i = 0; i < n; i++) {
        acc += (int32_t)b[i];
    }
    proc_result = acc;
    SIM_CHECK_HALF(b, n);             /* simulator: is this really the next half? */
}

static uint32_t half_mean(const volatile uint16_t *b, uint32_t n)
{
    uint32_t acc = 0;
    for (uint32_t i = 0; i < n; i++) {
        acc += b[i];
    }
    return acc / n;
}

bool capture_service(void)
{
    const uint32_t done = blocks_done;
    if (done == seen_blocks) {
        return false;
    }
    if ((done - seen_blocks) > 1u) {
        proc_missed += (done - seen_blocks) - 1u;
    }
    seen_blocks = done;
    process_buffer(capture_completed_half(), SAMPLES_PER_HALF);
    guard_check();                    /* did the DMA stay inside buf?    */

    /* Heartbeat: slow while clean, fast once any error counter moved. */
    if (led_get_mode() == 2u) {
        const bool clean = (dma_overrun | dma_addr_err | dma_bus_err |
                            late_service | proc_missed) == 0u;
        if ((done % (clean ? HEARTBEAT_OK : HEARTBEAT_ERR)) == 0u) {
            led_toggle();
        }
    }
    return true;
}

/* Wait until blocks_done passes a value. Returns 0, or 6 (nothing
 * moves) or 8 (the DMA switched itself off, e.g. on an address fault). */
static uint32_t wait_for_blocks(uint32_t target)
{
    uint32_t n = WAIT_LIMIT;
    while (blocks_done < target) {
        SIM_DMA_TICK();               /* simulator: deliver a half     */
        if (!dma0_enabled()) { return 8u; }
        if (--n == 0u)       { return 6u; }
    }
    guard_check();
    return 0u;
}

uint32_t capture_selftest(uint32_t *mean)
{
    const uint8_t  keep_pinsel = adc_pinsel();
    const uint8_t  keep_samc   = adc_samc();
    const bool     was_running = run_enabled;
    uint32_t       rc;

    (void)capture_set_input(SELFTEST_PINSEL, SELFTEST_SAMC);
    capture_start();

    /* The switch takes effect at the next DONE, then a full burst runs
     * on the new input: wait long enough that the half we judge is the
     * reference and nothing else. */
    rc = wait_for_blocks(blocks_done + SELFTEST_HALVES);
    if (rc == 0u) {
        const uint32_t m = half_mean(capture_completed_half(), SAMPLES_PER_HALF);
        selftest_mean = m;
        if (mean != NULL) { *mean = m; }
        if ((m < SELFTEST_MIN) || (m > SELFTEST_MAX)) { rc = 7u; }
    }

    if (rc == 0u) {
        console_kv("[selftest] mean on internal 15/16 VDD (expect ~3840)", selftest_mean);
    } else if (rc == 6u) {
        console_puts("[selftest] no DMA blocks arrived\r\n");
    } else if (rc == 7u) {
        console_kv("[selftest] mean outside 3648..4032", selftest_mean);
    } else {
        console_puts("[selftest] DMA channel disabled\r\n");
    }

    (void)capture_set_input(keep_pinsel, keep_samc);
    if (rc == 0u) {
        rc = wait_for_blocks(blocks_done + SELFTEST_HALVES);   /* settle */
    }
    if (!was_running) {
        capture_stop();
    }
    return rc;
}

/* ------------------------------------------------------------------ *
 * Rate self-test and the choice of pacing
 *
 * Timer1 (timebase.c) is only the stopwatch; the pacing source is what
 * produces the rate. For the active source: RATETEST_HALVES halves at
 * a slow period and at one four times shorter, ticks counted, delivered
 * rate compared with the nominal one (10 %) and the two with each other
 * (3..5x). The second check is the one that catches "the rate does not
 * move", which is what the board showed with back-to-back and SAMC.
 * The burst restart from the DMA interrupt costs a little per 2048
 * samples; the tolerance covers it.
 *
 * capture_autopace() runs this for every candidate when ADC_PACING is
 * AUTO and prints one verdict per source, so the log shows what each
 * one delivered - not only which one won.
 * ------------------------------------------------------------------ */
#define RATETEST_HALVES   200u
#define RATETEST_TOL_PCT  10u

#ifndef __MPLAB_DEBUGGER_SIMULATOR
/* Delivered rate at `period` (0 = leave the period alone, for B2B). */
static uint32_t rate_measure(uint32_t period, uint32_t *ksps)
{
    uint32_t n = WAIT_LIMIT;
    capture_stop();
    while (burst_active && (--n != 0u)) { SIM_DMA_TICK(); }
    if (n == 0u) { return 6u; }
    if (period != 0u) { (void)capture_set_period(period); }  /* idle: now */
    counters_clear();
    const uint32_t target = blocks_done + RATETEST_HALVES;
    const uint32_t t0     = timebase_ticks();
    capture_start();
    const uint32_t rc     = wait_for_blocks(target);
    const uint32_t ticks  = timebase_ticks() - t0;
    capture_stop();
    if (rc != 0u) { return rc; }
    *ksps = timebase_ksps(RATETEST_HALVES * SAMPLES_PER_HALF, ticks);
    return 0u;
}
#endif

uint32_t capture_ratetest(void)
{
#ifdef __MPLAB_DEBUGGER_SIMULATOR
    console_puts("[ratetest] skipped: the simulator has no ADC clock to measure\r\n");
    return 0u;
#else
    const uint8_t  pacing      = pacing_cur;
    const uint32_t keep        = capture_period();
    const bool     was_running = capture_running();
    uint32_t       ksps[2]     = { 0u, 0u };
    uint32_t       rc          = 0u;
    uint32_t       periods[2]  = { 0u, 0u };

